<?php
    session_start();
?>
<!DOCTYPE html>
<html>
    <head>
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <meta charset="utf-8"/>
        <title>Εισαγωγή στη C</title>
        <link rel="stylesheet" href="../styles/basics.css"/>
    </head>
    <body>
        <div class="header">
          <img src="media/logo.png" alt="logo" />
          <h1>SimpleCode</h1>
        </div>
        <nav class="menu" id="myMenu">
            <a href="index.php">Αρχική</a>
            <a class="active" href="basics.php">Το θέμα μου</a>
            <a href="more.php">Περισσότερα</a>
            <?php
                if(isset($_SESSION["username"]))
                    echo "<a href='quiz-lvl.php'>Quiz</a>";
                else
                    echo "<a href='quiz.php'>Quiz</a>";
            ?>
            <?php
                if(isset($_SESSION["username"])){
                    echo "<a href='get_results.php'>Αποτελέσματα Quiz</a>";
                    echo "<a href='account.php'>Λογαριασμός</a>";
                }else{
                    echo "<a href='sign-up.php'>Εγγραφή</a>";
                    echo "<a href='login.php'>Σύνδεση</a>";
                }
            ?>
            <?php
                if(isset($_SESSION['type'])){
                    if($_SESSION['type']=="Admin"){
                        echo "<a href='users.php'>Χρήστες</a>";
                    }
                    if($_SESSION['type']!="User"){
                        echo "<a href='questions.php'>Ερωτήσεις προς υποβολή</a>";
                    }
                }
            ?>
            <div>
                <a href="javascript:void(0);" class="icon" onclick="myFunction()">
                    <div class="men">Menu</div>
                </a>
            </div>
        </nav>

        <article class="board">
            <p class="title">
                <b>Εισαγωγή στη C</b>
            </p>
            <p class="p1">
                Αφού μάθαμε κάποια πράγματα για την ιστορία της C,ας ξεκινήσουμε σιγά σιγά να ασχοληθούμε με τον κώδικα. Αρχικά, θα αναφερθούμε στους τύπους μεταβλητών που υπάρχουν στη C,πώς γίνεται η δήλωση τους, πώς εμφανίζουμε δεδομένα στην οθόνη και πώς διαβάζουμε δεδομένα από το πληκτρολόγιο.<br><br>
                Για να ξεκινήσουμε να γράφουμε κώδικα, πρέπει πρώτα απ' όλα να ενσωματώσουμε στον κώδικα μας το αρχείο 'stdio.h' με την εντολή #include, επειδή περιέχει τις βασικές δηλώσεις των συναρτήσεων με τις οποίες γίνεται εμφάνιση δεδομένων στην οθόνη και εισαγωγή δεδομένων από το πληκτρολόγιο. Επιπλέον, είναι απαραίτητη η συνάρτηση main(), καθώς η εκτέλεση του προγράμματος ξεκινάει από την πρώτη εντολή που υπάρχει μέσα στη συνάρτηση.
            </p>
            <p class="p2"> <b>Δήλωση Μεταβλητών <br></b></p>
            <p class="p3"> Για να χρησιμοποιήσουμε μία μεταβλητή μέσα σε ένα πρόγραμμα πρέπει πρώτα να τη δηλώσουμε. Αυτό γίνεται με τον εξής τρόπο :</p>
            <p class="p4"> Τύπος_μεταβλητής  Όνομα_μεταβλητής</p>
            <p class="p5"> <b>Τύποι Μεταβλητών<br></b></p>
            <p class="p6"> Οι τύποι μεταβλητών που υπάρχουν στη C είναι οι εξής:<br><br></p>
            <table class="variables">
                <tr>
                    <th>Τύπος</th>
                    <th>Μέγεθος(bytes)</th>
                    <th>Εύρος τιμών</th>
                </tr>
                <tr>
                    <td>char</td>
                    <td>1</td>
                    <td>-128...127</td>
                </tr>
                <tr>
                    <td>short int</td>
                    <td>2</td>
                    <td>-32.768...32.767</td>
                </tr>
                <tr>
                    <td>int</td>
                    <td>4</td>
                    <td>-2.147.483.648...2.147.483.647</td>
                </tr>
                <tr>
                    <td>long int</td>
                    <td>4</td>
                    <td>-2.147.483.648...2.147.483.647</td>
                </tr>
                <tr>
                    <td>float</td>
                    <td>4</td>
                    <td>1.17*10<sup>-38</sup>...3.4*10<sup>38</sup></td>
                </tr>
                <tr>
                    <td>double</td>
                    <td>8</td>
                    <td>2.2*10<sup>-308</sup>...1.8*10<sup>308</sup></td>
                </tr>
                <tr>
                    <td>long double</td>
                    <td>8, 10, 12, 16</td>
                    <td>-</td>
                </tr>
                <tr>
                    <td>unsigned char</td>
                    <td>1</td>
                    <td>0...255</td>
                </tr>
                <tr>
                    <td>unsigned short int</td>
                    <td>2</td>
                    <td>0...65535</td>
                </tr>
                <tr>
                    <td>unsigned int</td>
                    <td>4</td>
                    <td>0...4.294.967.295</td>
                </tr>
                <tr>
                    <td>unsigned long int</td>
                    <td>4</td>
                    <td>0...4.294.967.295</td>
                </tr>
            </table>
            <p class="p7"> <br><b>Η συνάρτηση Printf<br></b></p>
            <p class="p8">
                Με τη χρήση της εντολής printf μπορούμε να εμφανίσουμε δεδομένα στην οθόνη. Η συνάρτηση αυτή δέχεται μια μεταβλητή λίστα παραμέτρεων :<br>
            </p>
            <ul class="list">
                <li>
                    Η πρώτη παράμετροςείναι ένα αλφαριθμητικό μορφοποίησης (format string), δηλαδή μία ακολουθία χαρακτήρων μέσα σε διπλά εισαγωγικά(" ") η οποία καθορίζει τον τρόπο με τον οποίο θα εμφανιστούν τα δεδομένα στην οθόνη. Το αλφαριθμητικό μορφοποίησης (format string)μπορεί να περιέχει είτε απλούς χαρακτήρες(οι οποίοι εμφανίζονται όπως είναι στην οθόνη) , είτε ακολουθίες Διαφυγής ,είτε Προσδιοριστικά Μετατροπής<br>
                </li>
                <li>
                    Οι επόμενες παράμετροιείναι προαιρετικές και, αν υπάρχουν, η printf()εμφανίζει τις τιμές τους στην οθόνη<br><br>
                </li>
            </ul>

            <p class="p9">
                <br><b>Ακολουθία Διαφυγής</b><br>
            </p>
            <p class="p10">
                Μία ακολουθία διαφυγής χρησιμοποιείται είτε για να μετακινηθεί ο δρομέας (cursor) σε κάποια θέση της οθόνης είτε για την εμφάνιση κάποιων ειδικών χαρακτήρων και αποτελείται από μία ανάστροφη κεκλιμένη (\) (backslash)και έναν ειδικό χαρακτήρα.<br><br>
            </p>
            <table class="escape_sequence">
                <tr>
                    <th>Ακολουθεία Διαφυγής</th>
                    <th>Σημασία</th>
                </tr>
                <tr>
                    <td>\a</td>
                    <td>Χρησιμοποιείται για την δημιουργία ηχητικού σήματος</td>
                </tr>
                <tr>
                    <td>\b</td>
                    <td>Χρησιμοποιείται για την διαγραφή του τελευταίου χαρακτήρα, όπως το backspase</td>
                </tr>
                <tr>
                    <td>\n</td>
                    <td>Χρησιμοποιείται για την αλλαγή γραμμής, όπως το Enter</td>
                </tr>
                <tr>
                    <td>\r</td>
                    <td>Χρησιμοποιείται για την επαναφορά του δρομέα στην αρχή της τρέχουσας γραμμής</td>
                </tr>
                <tr>
                    <td>\t</td>
                    <td>Χρησιμοποιείται για την μετακίνηση του δρομέα σε μια απόσταση ίση με το μήκος του tab, όπως το πλήκτρο tab</td>
                </tr>
                <tr>
                    <td>\\</td>
                    <td>Χρησιμοποιείται για την εμφάνιση της ανάστροφης κεκλιμένης(/)</td>
                </tr>
                <tr>
                    <td>\"</td>
                    <td>Χρησιμοποιείται για την εμφάνιση των διπλών εισαγωγικών(")</td>
                </tr>
            </table>
            <p class="p11">
                <b><br>Προσδιοριστικό Μετατροπής<br></b>
            </p>
            <p class="p12">
                Ένα προσδιοριστικό μετατροπής αρχίζει με τον χαρακτήρα % και ακολουθείται από έναν ή περισσότερους χαρακτήρες μετατροπήςπου έχουν ειδική σημασία.<br><br>
            </p>
            <table class="printf">
                <tr>
                    <th>Χαρακτήρας Μετατροπής</th>
                    <th>Σημασία</th>
                </tr>
                <tr>
                    <td>c</td>
                    <td>Χρησιμοποιείται για την εμφάνιση του χαρακτήρα που αντιστοιχεί σε μια ακέραια τιμή</td>
                </tr>
                <tr>
                    <td>d ή i</td>
                    <td>Χρησιμοποιείται για την εμφάνιση ενός ακέραιου</td>
                </tr>
                <tr>
                    <td>u</td>
                    <td>Χρησιμοποιείται για την εμφάνιση ενός μη-προσημασμένου ακέραιου</td>
                </tr>
                <tr>
                    <td>f</td>
                    <td>Χρησιμοποιείται για την εμφάνιση ενός πραγματικού αριθμού,εξ' ορισμού εμφανίζει 6 δεκαδικά ψηφία</td>
                </tr>
                <tr>
                    <td>s</td>
                    <td>Χρησιμοποιείται για την εμφάνιση των χαρακτήρων ενός αλφαριθμητικού</td>
                </tr>
                <tr>
                    <td>e ή E</td>
                    <td>Χρησιμοποιείται για την εμφάνιση ενός πραγματικού αριρμού σε επιστημονική μορφή</td>
                </tr>
                <tr>
                    <td>g ή G</td>
                    <td>Χρησιμοποιείται για την εμφάνιση ενός πραγματικού αριρμού σε κανονική ή επιστημονική μορφή</td>
                </tr>
                <tr>
                    <td>p</td>
                    <td>Χρησιμοποιείται για την εμφάνιση μιας διεύθηνσης μνήμης σε δεκαεξαδική μορφή</td>
                </tr>
                <tr>
                    <td>x ή X</td>
                    <td>Χρησιμοποιείται για την εμφάνιση ενός μη-προσημασμένου σε δεκαεξαδική μορφή</td>
                </tr>
                <tr>
                    <td>o</td>
                    <td>Χρησιμοποιείται για την εμφάνιση ενός μη-προσημασμένου ακέραιου σε οκταδική μορφή</td>
                </tr>
                <tr>
                    <td>%</td>
                    <td>Χρησιμοποιείται για την εμφάνιση του χαρακτήρα</td>
                </tr>
            </table>
            <p class="p13"> <br><b>Η Συνάρτηση Scanf</b><br></p>
            <p class="p14">Η συνάρτηση scanf() χρησιμοποιείται για την είσοδο δεδομένων από ένα αρχείο εισόδου, το οποίο ονομάζεται stdin(standardinput stream) και εξ’ ορισμού συνδέεται με το πληκτρολόγιο. Η scanf() δέχεται μία μεταβλητή λίστα παραμέτρων, παρόμοια με την printf(), δηλαδή:<br></p>
            <ul class="list">
                <li>
                    Η πρώτη παράμετροςείναι ένα αλφαριθμητικό μορφοποίησης (format string), το οποίο, συνήθως, περιέχει μόνο απλά προσδιοριστικά μετατροπής(π.χ. %d για μεταβλητές τύπου int, %fγια μεταβλητές τύπου floatκτλ...)<br>
                </li>
                <li>
                    Οι επόμενες προαιρετικές παράμετροιείναι οι διευθύνσεις μνήμηςτων μεταβλητών στις οποίες θα εκχωρηθούν τα δεδομένα που θα εισάγει ο χρήστης από το πληκτρολόγιο<br><br>
                </li>
            </ul>
            <p class="p15"><b><br>ΠΡΟΣΟΧΉ!!!Για μεταβλητές τύπου double,χρησιμοποιείται το προσδιοριστικό μετατροπής %lf και όχι το %f, το οποίο χρησιμοποιείται μόνο για μεταβλητές τύπου float!!<br></b></p>
            <div class="ex1">
                <p class="p16"> <br><b>Παράδειγμα 1<sup>o</sup></b></p>
                <p class="pcode1">Κώδικας 1<sup>oυ</sup> παραδείγματος</p>
                <img src="media/examples/code1.png" alt="ex1" class="code1"><br>
                <p class="pout1">Αποτέλεσμα 1<sup>oυ</sup> παραδείγματος</p>
                <img src="media/examples/out1.png" alt="out1" class="out1">
            </div>
            <div class="ex2">
                <p class="p17"> <br><b>Παράδειγμα 2<sup>o</sup></b></p>
                <p class="pcode2">Κώδικας 2<sup>oυ</sup> παραδείγματος</p>
                <img src="media/examples/code2.png" alt="ex2" class="code2"><br>
                <p class="pout2">Αποτέλεσμα 2<sup>oυ</sup> παραδείγματος</p>
                <img src="media/examples/out2.png" alt="out2" class="out2">
            </div>
            <div class="ex3">
                <p class="p18"> <br><b>Παράδειγμα 3<sup>o</sup>(με είσοδο 3)</b></p>
                <p class="pcode3">Κώδικας 3<sup>oυ</sup> παραδείγματος</p>
                <img src="media/examples/code3.png" alt="ex3" class="code3"><br>
                <p class="pout3">Αποτέλεσμα 3<sup>oυ</sup> παραδείγματος</p>
                <img src="media/examples/out3.png" alt="out3" class="out3">
            </div>
        </article>
        <script>
            function myFunction() {
              var x = document.getElementById("myMenu");
              if (x.className === "menu") {
                x.className += " responsive";
              } else {
                x.className = "menu";
              }
            }
        </script>

    </body>
</html>
